Config/Catalogs/ФорматыВыгрузкиБухгалтерскойОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФорматыВыгрузкиБухгалтерскойОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОФайле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОбработке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматУстарел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаВыгрузкаПрисоединенныхФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеСпособыОтправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеВидыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройкиФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокВыбораХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчаниюХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапоминатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрыватьВДереве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Флаг использования значения как выражения на встроенном языке</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ФорматыВыгрузкиБухгалтерскойОтчетности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Работа с теряемыми на клиенте данными

&НаСервере
Функция ПолучитьТеряемыеДанные()
	
	Если ЗначениеЗаполнено(АдресТеряемыхНаКлиентеДанных) Тогда 
		Возврат ПолучитьИзВременногоХранилища(АдресТеряемыхНаКлиентеДанных);
	КонецЕсли;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураТеряемыхДанных = Новый Структура;
	СтруктураТеряемыхДанных.Вставить("ХранилищеВнешнейОбработки");
	СтруктураТеряемыхДанных.Вставить("ДополнительныеНастройкиФормата");
	
	АдресТеряемыхНаКлиентеДанных = ПоместитьВоВременноеХранилище(СтруктураТеряемыхДанных,УникальныйИдентификатор);
	
	ОбновитьТеряемыеДанные(ТекущийОбъект,"ХранилищеВнешнейОбработки,ДополнительныеНастройкиФормата");
	
	Возврат СтруктураТеряемыхДанных; 
	
КонецФункции

&НаСервере
Процедура ОбновитьТеряемыеДанные(ТекущийОбъект,ЭлементыДляОбновления)
	
	СтруктураТеряемыхДанных = ПолучитьТеряемыеДанные();
	
	МассивЭлементовДляОбновления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЭлементыДляОбновления,,Истина);
	
	Для Каждого ЭлементДляОбновления из МассивЭлементовДляОбновления Цикл 
		
		Если ЭлементДляОбновления = "ХранилищеВнешнейОбработки" Тогда  
			СтруктураТеряемыхДанных[ЭлементДляОбновления] = ТекущийОбъект[ЭлементДляОбновления];
		КонецЕсли;
		
		Если ЭлементДляОбновления = "ДополнительныеНастройкиФормата" Тогда 
			СтруктураТеряемыхДанных[ЭлементДляОбновления] = ТекущийОбъект[ЭлементДляОбновления].Выгрузить();
		КонецЕсли;	
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураТеряемыхДанных,АдресТеряемыхНаКлиентеДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект)
	
	СтруктураТеряемыхДанных = ПолучитьТеряемыеДанные();	
	
	ЗаполнитьЗначенияСвойств(ТекущийОбъект,СтруктураТеряемыхДанных,,"ДополнительныеНастройкиФормата");

	ТекущийОбъект.ДополнительныеНастройкиФормата.Загрузить(СтруктураТеряемыхДанных.ДополнительныеНастройкиФормата); //Без этого при записи получаются пустые хранилища
	
КонецПроцедуры	

// Работа с теряемыми на клиенте данными
////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура УправлениеЭлементами()
	
	Элементы.ГруппаКнопокЗагрузки.Видимость = Не Объект.Предопределенный И ДоступнаЗагрузкаВнешних;
	Если Объект.Предопределенный Тогда 
		Элементы.ГруппаСтраницыОписанийОбработок.ТекущаяСтраница = Элементы.ГруппаСтраницаОписаниеВстроенойОбработки;
		Элементы.ФорматУстарел.ТолькоПросмотр = Истина;
	Иначе 
		Элементы.ГруппаСтраницыОписанийОбработок.ТекущаяСтраница = Элементы.ГруппаСтраницаОписаниеВнешнейОбработки;
	КонецЕсли;	
		
	Элементы.ГруппаПоддерживаемыеВидыОтчетов.Видимость = Объект.ПоддерживаемыеВидыОтчетов.Количество() > 0;
	Элементы.ГруппаСтраницаПоддерживаемыеСпособыОтправки.Видимость = Объект.ПоддерживаемыеСпособыОтправки.Количество() > 0; 
	Элементы.ГруппаДополнительныеНастройкиФормата.Видимость = Объект.ДополнительныеНастройкиФормата.Количество() > 0; 
	
КонецПроцедуры

// Прочее
////////////////////////////////////////////////////////////////////////////////
//Обработчики событий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПрава = РольДоступна("ДобавлениеВнешнихФорматовВыгрузкиБухгалтерскойОтчетности") Или Пользователи.ЭтоПолноправныйПользователь();
	ЭтоСервис = ОбщегоНазначения.РазделениеВключено();
	
	ДоступнаЗагрузкаВнешних = ЕстьПрава И Не ЭтоСервис;
	Если Объект.Ссылка.Пустая() Тогда 
		Если Не ДоступнаЗагрузкаВнешних Тогда 
			
			Если не ЕстьПрава Тогда 
				Сообщение = НСтр(
				"ru = 'Нет прав для загрузки обработок формата.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			КонецЕсли;
			
			Если ЭтоСервис Тогда 
				Сообщение = НСтр(
				"ru = 'Внешние форматы не поддерживаются в режиме сервиса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			КонецЕсли;
			
			Отказ = Истина;	
		КонецЕсли;	
	КонецЕсли;	
	
	УправлениеЭлементами();
	ЗаполнитьНаименованиеВидовОтчетов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьТеряемыеДанныеВОбъект(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьНаименованиеВидовОтчетов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьФорматаВыгрузкиБухгалтерскойОтчетности");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//Загрузка обработки

&НаКлиенте
Процедура ЗагрузитьФайлОбработки(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимРаботы", РежимДиалогаВыбораФайла.Открытие); 
	ДополнительныеПараметры.Вставить("МножественныйВыбор", Ложь);
	ДополнительныеПараметры.Вставить("Фильтр", НСтр("ru = 'Внешние обработки (*.epf)|*.epf'"));
	ДополнительныеПараметры.Вставить("Заголовок", НСтр("ru = 'Выберите обработку'"));
	ДополнительныеПараметры.Вставить("ПолноеИмяФайла", Объект.ИмяФайла);
	
	ДополнительныеПараметры.Вставить("ОбработкаОтсутствияРасширения",Новый ОписаниеОповещения("ЗагрузкаОбработкаВыбораФайлаБезРасширения",ЭтаФорма, Новый Структура("Этап","Начало")));
	
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата",Новый ОписаниеОповещения("ЗагрузкаПослеВыбораФайла", ЭтаФорма, Новый Структура("Этап","Начало")));
	
	БюджетнаяОтчетностьКлиент.ВыбратьФайлСпростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОбработкаВыбораФайлаБезРасширения(Результат, ДополнительныеПараметры) Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаОбработкаВыбораФайлаБезРасширения",ЭтаФорма,ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.Этап = "Начало" Тогда 
		
		ДополнительныеПараметры.Этап = "ПослеВыбора";
		
		ДополнительныеПараметрыВыбора = Новый Структура;
		ДополнительныеПараметрыВыбора.Вставить("ПервичнаяПроверка","Результат = Истина");
		ДополнительныеПараметрыВыбора.Вставить("ОбработкаРезультата",ОписаниеОповещения);
		
		ОповещениеПослеВыбора = Новый ОписаниеОповещения("ПриемникРезультатовПомещенияФайлов",БюджетнаяОтчетностьКлиент,ДополнительныеПараметрыВыбора);
		
		НачатьПомещениеФайла(ОповещениеПослеВыбора,,,Истина,УникальныйИдентификатор);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ПослеВыбора" Тогда 
			
		
		ДанныеРегистрации = Новый Структура;
		ДанныеРегистрации.Вставить("АдресДанныхОбработки",Результат.Адрес);
		ДанныеРегистрации.Вставить("СтруктураПутиФайла",ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Результат.ВыбранноеИмяФайла));
		
		
		ЗарегистрироватьОбработку(ДанныеРегистрации);
		
		УправлениеЭлементами();
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Обработка успешно загружена.'"),,,БиблиотекаКартинок.Успешно32);
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузкаПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаПослеВыбораФайла", ЭтаФорма, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.Этап = "Начало" Тогда 
		
		ПомещаемыеФайлы = Новый Массив;
		Для Каждого ВыбранныйФайл из Результат.ВыбранныеФайлы Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ВыбранныйФайл));
		КонецЦикла;	
		
		ДополнительныеПараметры.Этап = "ПослеПомещения";
		
		НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы,, Ложь, УникальныйИдентификатор);
		
		////////////////////////////////////////////////////////////////////////////////	
	ИначеЕсли ДополнительныеПараметры.Этап = "ПослеПомещения" Тогда	
		
		Если Результат = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ОписаниеПереданногоФайла = Результат[0];
		
		ДанныеРегистрации = Новый Структура;
		ДанныеРегистрации.Вставить("АдресДанныхОбработки",ОписаниеПереданногоФайла.Хранение);
		ДанныеРегистрации.Вставить("СтруктураПутиФайла",ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ОписаниеПереданногоФайла.Имя));
		
		
		ЗарегистрироватьОбработку(ДанныеРегистрации);
		
		УправлениеЭлементами();
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Обработка успешно загружена.'"),,,БиблиотекаКартинок.Успешно32);
		
	КонецЕсли;  
	
КонецПроцедуры	

&НаСервере
Процедура ЗарегистрироватьОбработку(ДанныеРегистрации)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекущийОбъект.ЗарегистрироватьОбработку(ДанныеРегистрации);
	
	ОбновитьТеряемыеДанные(ТекущийОбъект,"ХранилищеВнешнейОбработки,ДополнительныеНастройкиФормата");
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
	ЗаполнитьНаименованиеВидовОтчетов();
КонецПроцедуры	


//Загрузка обработки
////////////////////////////////////////////////////////////////////////////////
//Выгрузка обработки

&НаКлиенте
Процедура ВыгрузитьФайлОбработки(Команда)
	
	АдресДанныхОбработки = ПоместитьОбработкуВХранилище();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РежимРаботы", РежимДиалогаВыбораФайла.Сохранение); 
	ДополнительныеПараметры.Вставить("МножественныйВыбор", Ложь);
	ДополнительныеПараметры.Вставить("Фильтр", НСтр("ru = 'Внешние обработки (*.epf)|*.epf'"));
	ДополнительныеПараметры.Вставить("Заголовок", НСтр("ru = 'Выберите обработку'"));
	ДополнительныеПараметры.Вставить("ПолноеИмяФайла", Объект.ИмяФайла);
	
	ДополнительныеПараметры.Вставить("ОбработкаОтсутствияРасширения",Новый ОписаниеОповещения("ВыгрзкаОбработкаВыбораФайлаБезРасширения",ЭтаФорма,Новый Структура("АдресДанныхОбработки",АдресДанныхОбработки)));
	
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата",Новый ОписаниеОповещения("ВыгрзкаПослеВыбораФайла", ЭтаФорма, Новый Структура("АдресДанныхОбработки",АдресДанныхОбработки)));
	
	
	БюджетнаяОтчетностьКлиент.ВыбратьФайлСпростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрзкаОбработкаВыбораФайлаБезРасширения(Результат, ДополнительныеПараметры) Экспорт
	
	ПолучитьФайл(ДополнительныеПараметры.АдресДанныхОбработки, Объект.ИмяФайла, Истина);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрзкаПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранныйФайл = Результат.ВыбранныеФайлы[0];
	
	ПолучаемыеФайлы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ОписаниеПередаваемогоФайла(ВыбранныйФайл,  ДополнительныеПараметры.АдресДанныхОбработки));
	
	НачатьПолучениеФайлов(Новый ОписаниеОповещения("ПустоеОповещение", БюджетнаяОтчетностьКлиент),ПолучаемыеФайлы, , Ложь);
	
КонецПроцедуры	


&НаСервере
Функция ПоместитьОбработкуВХранилище()
	
	СтруктураТеряемыхДанных = ПолучитьТеряемыеДанные();
	
	ДанныеОбработки = СтруктураТеряемыхДанных.ХранилищеВнешнейОбработки.Получить();
	
	Если ТипЗнч(ДанныеОбработки) <> Тип("ДвоичныеДанные") Тогда 
		ВызватьИсключение НСтр("ru = 'Нет данных для сохранения.'");
	КонецЕсли;	
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОбработки,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции	

//Выгрузка обработки
////////////////////////////////////////////////////////////////////////////////


&НаСервере
Процедура ОбновитьНастройкиНаСервере()
	Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ОбновитьНастройкиФорматов(Объект.Ссылка);
	ЭтаФорма.Прочитать();
	ЗаполнитьНаименованиеВидовОтчетов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОчиститьСообщения();
		ОбновитьНастройкиНаСервере();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованиеВидовОтчетов()
	
	Если Объект.ПоддерживаемыеВидыОтчетов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтчетов.Наименование,
		|	ВидыОтчетов.Код
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Код В(&КодыВидовОтчетов)";
	
	Запрос.УстановитьПараметр("КодыВидовОтчетов", Объект.ПоддерживаемыеВидыОтчетов.Выгрузить().ВыгрузитьКолонку("КодВидаОтчета"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрТЧ Из Объект.ПоддерживаемыеВидыОтчетов Цикл
		Если ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Код",СтрТЧ.КодВидаОтчета)) Тогда
			СтрТЧ.НаименованиеВидаОтчета = ВыборкаДетальныеЗаписи.Наименование;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
	КонецЦикла;
	
КонецПроцедуры
